Repository: olimpiadi-informatica/quizms
Catalog: packages/quizms/src/locales/*.po
Languages: it

source: {0} {1} is trying to access the competition. To approve them, enter the confirmation code that was shown to them.
it: {0} {1} sta cercando di accedere alla gara. Per approvarlo, inserisci il codice di conferma che gli è stato mostrato.

source: {0} missing
it: {0} mancante

source: <0>Warning:</0> this operation is irreversible.
it: <0>Attenzione:</0> questa operazione è irreversibile.

source: Absent
it: Assente

source: Access Requests
it: Richieste di accesso

source: Access the contest
it: Accedi alla gara

source: Add
it: Aggiungi

source: Add announcement
it: Aggiungi annuncio

source: After finalizing, it will <0>no longer</0> be possible to <1>add</1> new students or <2>modify</2> student data in this school for the competition <3>{0}</3>.
it: Dopo la finalizzazione, <0>non sarà più</0> possibile <1>aggiungere</1> nuovi studenti o <2>modificare</2> i dati degli studenti in questa scuola per la gara <3>{0}</3>.

source: After finalizing, it will <0>no longer</0> be possible to <1>modify</1> student data in this school for the competition <2>{0}</2>.
it: Dopo la finalizzazione, <0>non sarà più</0> possibile <1>modificare</1> i dati degli studenti in questa scuola per la gara <2>{0}</2>.

source: all schools
it: tutte le scuole

source: all students
it: tutti gli studenti

source: all students have been correctly entered
it: tutti gli studenti sono stati inseriti correttamente

source: An error occurred in the application.
it: Si è verificato un errore nell'applicazione.

source: Announcements
it: Annunci

source: Anonymous user
it: Utente anonimo

source: Answer
it: Risposta

source: Approve
it: Approva

source: Are you sure you want to cancel the start of the contest?
it: Sei sicuro di voler annullare l'inizio della gara?

source: Are you sure you want to finish?
it: Sei sicuro di voler terminare?

source: Are you sure you want to start the contest?
it: Sei sicuro di voler iniziare la gara?

source: At least one student doesn't have a name or surname
it: Almeno uno studente non ha nome o cognome

source: Back
it: Indietro

source: Cancel
it: Annulla

source: Cancel contest start
it: Annulla inizio gara

source: Code expired
it: Codice scaduto

source: Code expired.
it: Codice scaduto.

source: Code:
it: Codice:

source: Confirm
it: Conferma

source: Confirmation code
it: Codice di conferma

source: Contest
it: Gara

source: Contest code
it: Codice gara

source: Contest completed
it: Gara completata

source: Contest Information
it: Informazioni sulla gara

source: Contest instructions
it: Istruzioni della gara

source: Contest Management
it: Gestione della gara

source: Contest settings
it: Impostazioni gara

source: Contest started at <0/>.
it: Gara iniziata alle ore <0/>.

source: Contest will start in:<0><1/></0>
it: La gara inizierà tra:<0><1/></0>

source: Continue
it: Continua

source: CSV File
it: File CSV

source: Delete
it: Elimina

source: Delete student
it: Elimina studente

source: Deleted
it: Eliminato

source: Don't show this pop-up again
it: Non mostrare più questo pop-up

source: Download PDF with all variants
it: Scarica PDF con tutte le varianti

source: Download ZIP with all variants
it: Scarica ZIP con tutte le varianti

source: Empty
it: Vuoto

source: Enter {0}
it: Inserisci {0}

source: Enter code
it: Inserisci codice

source: Enter message
it: Inserisci messaggio

source: Enter title
it: Inserisci titolo

source: Enter variant code
it: Inserisci codice variante

source: Error
it: Errore

source: Error in row {0}: {1}
it: Errore nella riga {0}: {1}

source: Error in row {0}: Missing variant
it: Errore nella riga {0}: Variante mancante

source: Error in row {0}: The variant "{variantId}" is not valid
it: Errore nella riga {0}: La variante "{variantId}" non è valida

source: Error in row {0}: Too few fields
it: Errore nella riga {0}: Troppi pochi campi

source: Export
it: Esporta

source: Export {0}
it: Esporta {0}

source: Export {label}
it: Esporta {label}

source: Finalize
it: Finalizza

source: Finalize School
it: Finalizza scuola

source: Finalized
it: Finalizzato

source: Finalized schools: {finalizedSchools}
it: Scuole finalizzate: {finalizedSchools}

source: Terminate
it: Termina

source: High
it: Alta

source: If this student was added by mistake and you want to remove them, you can use the<0> Delete</0> button in the last column.
it: Se questo studente è stato aggiunto per errore e desideri rimuoverlo, puoi utilizzare il pulsante <0>Elimina</0> nell'ultima colonna.

source: If you are using Excel, you can create a CSV file by going to “<0>Save as</0>” and choosing “<1>Comma separated values (.csv)</1>” as the file format.
it: Se stai utilizzando Excel, puoi creare un file CSV andando su “<0>Salva con nome</0>” e scegliendo “<1>Valori separati da virgola (.csv)</1>” come formato del file.

source: If you started the contest by mistake, you can still cancel the contest up to one minute before it starts.
it: Se hai iniziato la gara per sbaglio, puoi annullare la gara fino a un minuto prima dell'inizio.

source: If you understand and agree, write “<0>{correctConfirm}</0>”.
it: Se hai compreso e sei d'accordo, scrivi “<0>{correctConfirm}</0>”.

source: Import
it: Importa

source: Import students
it: Importa studenti

source: Import students from a file. The file must be in <0>CSV</0> format, the first row must contain the header. <1>Do not</1> leave empty rows before the header or empty columns before the data.
it: Importa studenti da un file. Il file deve essere in formato <0>CSV</0>, la prima riga deve contenere l'intestazione. <1>Non</1> lasciare righe vuote prima dell'intestazione o colonne vuote prima dei dati.

source: Incorrect password
it: Password errata

source: Incorrect username
it: Nome utente errato

source: Invalid code.
it: Codice non valido.

source: It is not possible to finalize the school due to the following error:
it: Non è possibile finalizzare la scuola a causa del seguente errore:

source: Latest tokens
it: Ultimi token

source: Loading...
it: Caricamento in corso...

source: Login
it: Accedi

source: Login using your {0} credentials
it: Accedi usando le tue credenziali {0}

source: Logout
it: Esci

source: Manage schools
it: Gestisci scuole

source: Manage students
it: Gestione degli studenti

source: Manage students and answers
it: Gestisci studenti e risposte

source: Message
it: Messaggio

source: Missing variant
it: Variante mancante

source: Name
it: Nome

source: No announcements.
it: Nessuna comunicazione.

source: No requests.
it: Nessuna richiesta.

source: No tokens generated.
it: Nessun token generato.

source: Normal
it: Normale

source: Not deleted
it: Non eliminati

source: Once confirmed, you will not be able to modify your answers.
it: Una volta confermato, non potrai più modificare le tue risposte.

source: Online variants
it: Varianti online

source: open
it: apri

source: Present
it: Presente

source: Printed variants
it: Varianti stampate

source: Priority
it: Priorità

source: Question
it: Domanda

source: Reject
it: Rifiuta

source: Reload
it: Ricarica

source: Restart
it: Ricomincia

source: Save
it: Salva

source: School
it: Scuola

source: schools
it: scuole

source: Schools
it: Scuole

source: Score
it: Punteggio

source: Select a contest
it: Seleziona una gara

source: Select all
it: Seleziona tutti

source: Select priority
it: Seleziona priorità

source: Show results
it: Mostra risultati

source: Solution
it: Soluzione

source: Start online contest
it: Avvia gara online

source: Start the contest
it: Inizia la gara

source: Start time
it: Ora di inizio

source: Student already registered
it: Studente già registrato

source: students
it: studenti

source: Students
it: Studenti

source: Surname
it: Cognome

source: The {label} field cannot be longer than 256 characters.
it: Il campo {label} non può essere più lungo di 256 caratteri.

source: The {label} field must be an integer.
it: Il campo {label} deve essere un numero intero.

source: The answer "{answer}" is not valid
it: La risposta "{answer}" non è valida

source: The answer must be an integer
it: La risposta deve essere un numero intero

source: The columns must be in the following order:
it: Le colonne devono essere nel seguente ordine:

source: The contest can be taken from <0/> until <1/>.
it: La gara può essere svolta da <0/> fino a <1/>.

source: The contest has been completed.
it: La gara è stata completata.

source: The contest has ended.
it: La gara è terminata.

source: The contest has not started yet!
it: La gara non è ancora iniziata!

source: The contest will end at <0/>.
it: La gara terminerà alle <0/>.

source: The contest will start at <0/>.
it: La gara inizierà alle ore <0/>.

source: The entered code does not match the selected contest.
it: Il codice inserito non corrisponde alla gara selezionata.

source: The field {label} contains invalid characters. Make sure there are no numbers or symbols and that the encoding is UTF-8.
it: Il campo {label} contiene caratteri non validi. Assicurati che non ci siano numeri o simboli e che la codifica sia UTF-8.

source: The field {label} contains invalid characters. Make sure there are no numbers or symbols.
it: Il campo {label} contiene caratteri non validi. Assicurati che non ci siano numeri o simboli.

source: The field {label} must be greater than or equal to {0}.
it: Il campo {label} deve essere maggiore o uguale a {0}.

source: The field {label} must be less than or equal to {0}.
it: Il campo {label} deve essere minore o uguale a {0}.

source: The field {label} must contain a date after {0}.
it: Il campo {label} deve contenere una data successiva al {0}.

source: The field {label} must contain a date prior to {0}.
it: Il campo {label} deve contenere una data precedente al {0}.

source: The fields <0>{0}</0> must be in the format <1>{1}</1>, for example <2>{2}</2>.
it: I campi <0>{0}</0> devono essere nel formato <1>{1}</1>, ad esempio <2>{2}</2>.

source: The score must be an integer
it: Il punteggio deve essere un numero intero

source: The score must be between 0 and {0}
it: Il punteggio deve essere compreso tra 0 e {0}

source: The student {name} {surname} cannot be finalized: {0}.
it: Lo studente {name} {surname} non può essere finalizzato: {0}.

source: The student {name} {surname} has been entered multiple times
it: Lo studente {name} {surname} è stato inserito più volte

source: The variant {0} is not valid
it: La variante {0} non è valida

source: This field cannot contain numbers or symbols.
it: Questo campo non può contenere numeri o simboli.

source: This page is intentionally left blank
it: Questa pagina è intenzionalmente vuota

source: Time remaining until start: <0/>
it: Tempo rimanente all'inizio: <0/>

source: Time remaining: <0/>
it: Tempo rimanente: <0/>

source: Title
it: Titolo

source: To allow personal data entry before the contest, the <0>Variant</0> column and the columns for answers can be left blank. For finalization, it will still be necessary to fill them in.
it: Per consentire l’inserimento dei dati personali prima della gara, la colonna <0>Variante</0> e le colonne per le risposte possono essere lasciate vuote. Per la finalizzazione, sarà comunque necessario compilarle.

source: To allow personal data entry before the contest, the columns for answers can be left blank. For finalization, it will still be necessary to fill them in.
it: Per consentire l’inserimento dei dati personali prima della gara, le colonne per le risposte possono essere lasciate vuote. Per la finalizzazione, sarà comunque necessario compilarle.

source: Token already exists, please try again.
it: Token già esistente, riprova.

source: Too many attempts, please wait 5 minutes and try again
it: Troppi tentativi, attendi 5 minuti e riprova

source: Total schools: {totalSchools}
it: Totale scuole: {totalSchools}

source: Total students: {totalStudents}
it: Totale studenti: {totalStudents}

source: Variant
it: Variante

source: Variant {value} is not valid
it: La variante {value} non è valida

source: Variant code
it: Codice variante

source: Variant not found
it: Variante non trovata

source: Variant not found, please contact the platform administrators.
it: Variante non trovata, si prega di contattare gli amministratori della piattaforma.

source: View Test
it: Visualizza Test

source: Warning
it: Attenzione

source: You are about to delete <0>{studentName}</0>.
it: Stai per eliminare <0>{studentName}</0>.

source: You are about to delete <0>all</0> entered students. You can view deleted students and cancel their deletion by clicking on the header of the column “<1>Delete</1>” and choosing “<2>Select all</2>” as a filter.
it: Stai per eliminare <0>tutti</0> gli studenti inseriti. Puoi visualizzare gli studenti eliminati e annullare la loro eliminazione facendo clic sull’intestazione della colonna “<1>Elimina</1>” e scegliendo “<2>Seleziona tutti</2>” come filtro.

source: You are about to delete a student.
it: Stai per eliminare uno studente.

source: You are about to export {description} data from the contest <0>{0}</0>. This operation executes a large number of database queries that will take time and may affect project billing.
it: Stai per esportare i dati {description} della gara <0>{0}</0>. Questa operazione esegue un gran numero di query al database che richiederanno tempo e potrebbero influire sulla fatturazione del progetto.

source: You can view deleted students and cancel the deletion by clicking on the header of the column “<0>Delete</0>” and choosing “<1>Select all</1>” as a filter.
it: Puoi visualizzare gli studenti eliminati e annullare l’eliminazione facendo clic sull’intestazione della colonna “<0>Elimina</0>” e scegliendo “<1>Seleziona tutti</1>” come filtro.

source: You scored <0>{0}</0> out of <1>{maxPoints}</1>.
it: Hai ottenuto <0>{0}</0> su <1>{maxPoints}</1>.

source: Your account is already present on another device. To transfer access to the current device, communicate the following code to your teacher:
it: Il tuo account è già presente su un altro dispositivo. Per trasferire l’accesso al dispositivo attuale, comunica il seguente codice al tuo insegnante:

source: Your browser does not support data export. Please use Chrome or Edge.
it: Il tuo browser non supporta l’esportazione dei dati. Utilizza Chrome o Edge.
